# 1. Orders tablosunda kaç musteri var?

In [1]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in c:\\users\\r\\anaconda3\\lib\\site-packages (0.4.1)',
 'Requirement already satisfied: sqlparse in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (0.4.2)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: prettytable<1 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (0.7.2)',
 'Requirement already satisfied: six in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (1.15.0)',
 'Requirement already satisfied: ipython>=1.0 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (7.19.0)',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython-sql) (1.3.20)',
 'Requirement already satisfied: colorama; sys_platform == "win32" in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)',
 'Requirement already satisfied: pickleshare in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: decorator in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (4.4.2)',
 'Requirement already satisfied: setuptools>=18.5 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (50.3.1.post20201107)',
 'Requirement already satisfied: jedi>=0.10 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.17.1)',
 'Requirement already satisfied: traitlets>=4.2 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)',
 'Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (3.0.8)',
 'Requirement already satisfied: backcall in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)',
 'Requirement already satisfied: pygments in c:\\users\\r\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-sql) (2.7.2)',
 'Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\\users\\r\\anaconda3\\lib\\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.0)',
 'Requirement already satisfied: wcwidth in c:\\users\\r\\anaconda3\\lib\\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)']

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///first-database-sql.db

In [6]:
%%sql 
SELECT COUNT (CustomerID) 
FROM Orders;

 * sqlite:///first-database-sql.db
Done.

[(392,)]

# 2. Orders tablosunda kaç tane unique musteri var?

In [7]:
%%sql 
SELECT COUNT( DISTINCT CustomerID) 
FROM Orders;

 * sqlite:///first-database-sql.db
Done.

[(74,)]

(unique CustomerID sayısı bulunmus oldu.)

# 3. Customers tablosunda hangi ülkeden kaçar tane musteri var?

In [8]:
%%sql
SELECT * FROM Customers LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden')]

In [9]:
%%sql 
SELECT COUNT (CustomerID), Country 
FROM Customers 
GROUP BY Country LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(3, 'Argentina'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (9, 'Brazil'),
 (3, 'Canada')]

# 4. Musterilerin ulkesi Brazil ya da USA olanlar?

In [10]:
%%sql 
SELECT * FROM Customers 
WHERE Country = "Brazil" LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil'),
 (61, 'Que Delícia', 'Bernardo Batista', 'Rua da Panificadora, 12', 'Rio de Janeiro', '02389-673', 'Brazil')]

In [11]:
%%sql 
SELECT * FROM Customers 
WHERE Country = "USA" LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA'),
 (48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA')]

In [12]:
%%sql 
SELECT * FROM Customers 
WHERE Country = "USA" OR Country = "Brazil" LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil')]

In [14]:
%%sql 
SELECT * FROM Customers 
WHERE Country IN ("USA", "Brazil") LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(15, 'Comércio Mineiro', 'Pedro Afonso', 'Av. dos Lusíadas, 23', 'São Paulo', '05432-043', 'Brazil'),
 (21, 'Familia Arquibaldo', 'Aria Cruz', 'Rua Orós, 92', 'São Paulo', '05442-030', 'Brazil'),
 (31, 'Gourmet Lanchonetes', 'André Fonseca', 'Av. Brasil, 442', 'Campinas', '04876-786', 'Brazil'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (34, 'Hanari Carnes', 'Mario Pontes', 'Rua do Paço, 67', 'Rio de Janeiro', '05454-876', 'Brazil')]

# 5. Once ulkeye sonra sehre gore group by yapıp bu kirilimdaki musteri sayisi?

In [15]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi, Country 
From Customers 
GROUP BY Country LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(3, 'Argentina'),
 (2, 'Austria'),
 (2, 'Belgium'),
 (9, 'Brazil'),
 (3, 'Canada')]

In [16]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi, City 
From Customers 
GROUP BY City LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(1, 'Aachen'),
 (1, 'Albuquerque'),
 (1, 'Anchorage'),
 (1, 'Barcelona'),
 (1, 'Barquisimeto')]

In [17]:
%%sql
SELECT COUNT(CustomerID) AS Musteri_Sayisi, Country, City 
FROM Customers 
GROUP BY Country, City LIMIT 5;

 * sqlite:///first-database-sql.db
Done.

[(3, 'Argentina', 'Buenos Aires'),
 (1, 'Austria', 'Graz'),
 (1, 'Austria', 'Salzburg'),
 (1, 'Belgium', 'Bruxelles'),
 (1, 'Belgium', 'Charleroi')]